heatedDuctMultiRegCHT/constant/fluid/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/fluid/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          100;
        startFace       19015;
    }
    outlet
    {
        type            patch;
        nFaces          100;
        startFace       19115;
    }
    fixedWalls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          200;
        startFace       19215;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          19260;
        startFace       19415;
    }
    fluid_to_metal
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          90;
        startFace       38675;
        sampleMode      nearestPatchFace;
        sampleRegion    metal;
        samplePatch     metal_to_fluid;
    }
)

// ************************************************************************* //
